#+STARTUP: showall
# Frame layout for presentation:  <burly-open-bookmark "hyperorg">
# {M-: (setq org-image-actual-width (list 500)) RET C-c C-x C-v}
#+TODO: Bob-TODO:  Bob-ACTV:  | Bob-DONE:
#+TODO: Mats-TODO: Mats-ACTV: | Mats-DONE:

** Code Block Support

#+BEGIN_SRC shell :results output
  echo $PATH
#+END_SRC

#+RESULTS:
: /Users/bk/.nix-profile/bin:/Library/Frameworks/Python.framework/Versions/3.8/bin:/Applications:/Applications/Emacs26.app/Contents/MacOS/libexec:/Applications/Emacs26.app/Contents/MacOS/bin:/usr/local/opt/findutils/libexec/gnubin:/usr/local/sbin:/usr/local/Cellar/python3/libexec/bin:/usr/local/opt/libexec/gnubin:/Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin:/usr/local/bin:/usr/local/Cellar/python@3.9/3.9.2_2/Frameworks/Python.framework/Versions/3.9/bin:/Users/bk/sw-dev/cappuccino/bin:/usr/local/ActivePerl-5.12/bin:/usr/local/ActivePerl-5.12/site/bin:/usr/local/bin:/opt/local/bin:/opt/local/sbin:/usr/local/opt/texinfo/bin:/sw/bin:/usr/bin:/bin:/usr/sbin:/sbin:/opt/X11/bin:/usr/local/git/bin:/Library/TeX/texbin:/Users/bk/sw-dev/gnu/gnulib/build-aux:/Library/Developer/CommandLineTools/usr/bin


#+BEGIN_SRC python :dir ~/Dropbox/py/rsw_py_stack :results output
  from stack import Stack

  assert_expr = lambda expr: print(' ; '.join([f"{e:<30} => {eval(str(e))}" for e in [expr]]))
  s1 = Stack(0, 1, 2)
  s2 = Stack()
  assert_expr('s1')
  assert_expr('s2')
  assert_expr('s1.top() == 2')
  assert_expr('s2.top() is None')
  assert_expr('s1.is_empty() is False')
  assert_expr('s2.is_empty() is True')
  assert_expr('s1 and not s2 is True')
  assert_expr('s2.push("a") == Stack("a")')
  assert_expr('s1 + s2')
  assert_expr('s1 == Stack(0, 1, 2, "a")')
  assert_expr('s1.pop() == "a"')
  assert_expr('s1 * 2')
  assert_expr('s1 == Stack(0, 1, 2, 0, 1, 2)')

#+END_SRC

#+RESULTS:
#+begin_example
s1                             => Stack(0, 1, 2)
s2                             => Stack()
s1.top() == 2                  => True
s2.top() is None               => True
s1.is_empty() is False         => True
s2.is_empty() is True          => True
s1 and not s2 is True          => True
s2.push("a") == Stack("a")     => True
s1 + s2                        => Stack(0, 1, 2, 'a')
s1 == Stack(0, 1, 2, "a")      => True
s1.pop() == "a"                => True
s1 * 2                         => Stack(0, 1, 2, 0, 1, 2)
s1 == Stack(0, 1, 2, 0, 1, 2)  => True
#+end_example

